In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [32]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

# 추가

### 칼럼 추가

In [8]:
df['test1'] = [1,2,3,4]

In [4]:
df['test2'] = df['eng'] + df['math']

In [9]:
df

   eng  kor  math  test2  test1
a   10   20    90    100      1
b   30   40    50     80      2
c   50   60    20     70      3
d   70   80    70    140      4

### 로우 추가

In [11]:
df.loc['e'] = [1,2,3]
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e    1    2     3

# 삭제

In [12]:
df.drop(index=['a','c'])

   eng  kor  math
b   30   40    50
d   70   80    70
e    1    2     3

In [13]:
df.drop(columns=['eng','math'])

   kor
a   20
b   40
c   60
d   80
e    2

# 결측데이터 (대표값, 삭제)

In [15]:
df.loc['b':'c','kor'] = np.nan
df.loc['c','math'] = np.nan

In [17]:
df

   eng   kor  math
a   10  20.0  90.0
b   30   NaN  50.0
c   50   NaN   NaN
d   70  80.0  70.0

In [18]:
df.isna()

     eng    kor   math
a  False  False  False
b  False   True  False
c  False   True   True
d  False  False  False

In [19]:
# 디폴트 데이터프레임 동계함수: 컬럼단위
df.isna().sum()

eng     0
kor     2
math    1
dtype: int64

In [20]:
df.fillna(10)

   eng   kor  math
a   10  20.0  90.0
b   30  10.0  50.0
c   50  10.0  10.0
d   70  80.0  70.0

In [21]:
df['kor'].fillna(10)

a    20.0
b    10.0
c    10.0
d    80.0
Name: kor, dtype: float64

In [23]:
df.dropna()

   eng   kor  math
a   10  20.0  90.0
d   70  80.0  70.0

In [24]:
df.dropna(axis=1) #axis =1 컬럼삭제

   eng
a   10
b   30
c   50
d   70

In [25]:
df.dropna( subset=['math'] )

   eng   kor  math
a   10  20.0  90.0
b   30   NaN  50.0
d   70  80.0  70.0

# 정렬

In [27]:
df.sort_values( by = 'eng' )

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [28]:
df.sort_values(by='math', ascending=False)

   eng  kor  math
a   10   20    90
d   70   80    70
b   30   40    50
c   50   60    20

In [29]:
df.loc['c', 'kor'] = 40

In [31]:
df.sort_values(by=['kor', 'math'])

   eng  kor  math
a   10   20    90
c   50   40    20
b   30   40    50
d   70   80    70

In [ ]:
###